export const logo = {
  left: [
    "                    ",
    "█▀▀█ ▀▀█▀ █▀▀▀ ▀▀▀█",
    "█  █ _█_█ █▀▀_ █▀▀█",
    "▀  ▀ ▀▀▀▀ ▀    ▀__▀",
  ],
  right: [
    "          ",
    "█▀▀▀ █▀▀▀",
    "█___ █▀▀_",
    "▀▀▀▀ ▀▀▀▀",
  ],
}

const n0faceMascot = {
  left: [
    "▄█     █▄    ",
    " ███████████  ",
    "██▌█████▐████ ",
    " ███▄▄▄█████ █▀",
    "   ███████   █ ",
    "   ███████ █▀▀ ",
    "   ▀██ ██▀▀▀▀  ",
  ],
  right: ["", "", "", "", "", "", ""],
}

export const go = {
  left: ["    ", "█▀▀▀", "█_^█", "▀▀▀▀"],
  right: ["    ", "█▀▀█", "█__█", "▀▀▀▀"],
}
export const marks = "_^~,"

export const MASCOT_VERSION = 3

export const builtinMascot = {
  version: MASCOT_VERSION,
  shapes: {
    idle: n0faceMascot,
    thinking: n0faceMascot,
    planning: n0faceMascot,
  },
}
