export const logo = {
  left: [
    "                         ",
    " ▒█████████   ▒██████████",
    " ▒█       █   ▒█  ▒■■  ▒█",
    " ▒█       █   ▒█  ▒■■  ▒█",
    " ▒█ ▒■■■  █   ▒█  ▒■■  ▒█",
    " ▒█       █   ▒█       ▒█",
    " ▒█       █   ▒█       ▒█",
  ],
  right: Array(7).fill(""),
}

const amMascot = {
  left: [
    "▄█     █▄    ",
    " ███████████  ",
    "██▌█████▐████ ",
    " ███▄▄▄█████ █▀",
    "   ███████   █ ",
    "   ███████ █▀▀ ",
    "   ▀██ ██▀▀▀▀  ",
  ],
  right: ["", "", "", "", "", "", ""],
}

export const go = {
  left: ["    ", "█▀▀▀", "█_^█", "▀▀▀▀"],
  right: ["    ", "█▀▀█", "█__█", "▀▀▀▀"],
}
export const marks = "_^~,"

export const MASCOT_VERSION = 3

export const builtinMascot = {
  version: MASCOT_VERSION,
  shapes: {
    idle: amMascot,
    thinking: amMascot,
    planning: amMascot,
  },
}
